{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 149], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 149], "dtype": "int32", "sparse": false, "ragged": false, "name": "attention_mask"}, "name": "attention_mask", "inbound_nodes": []}, {"class_name": "TFBertModel", "config": {"return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "architectures": null, "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "problem_type": null, "_name_or_path": "readerbench/RoBERT-base", "transformers_version": "4.15.0", "do_lower_case": 1, "do_remove_accents": 0, "gradient_checkpointing": false, "model_type": "bert", "vocab_size": 37788, "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "hidden_act": "gelu", "intermediate_size": 3072, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 512, "type_vocab_size": 2, "initializer_range": 0.02, "layer_norm_eps": 1e-12, "position_embedding_type": "absolute", "use_cache": true, "classifier_dropout": null}, "name": "tf_bert_model", "inbound_nodes": [[["input_ids", 0, 0, {"attention_mask": ["attention_mask", 0, 0]}]]]}, {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "gru", "inbound_nodes": [[["tf_bert_model", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["gru", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_37", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "outputs", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "outputs", "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0], ["attention_mask", 0, 0]], "output_layers": [["outputs", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of110.bin", "group1-shard2of110.bin", "group1-shard3of110.bin", "group1-shard4of110.bin", "group1-shard5of110.bin", "group1-shard6of110.bin", "group1-shard7of110.bin", "group1-shard8of110.bin", "group1-shard9of110.bin", "group1-shard10of110.bin", "group1-shard11of110.bin", "group1-shard12of110.bin", "group1-shard13of110.bin", "group1-shard14of110.bin", "group1-shard15of110.bin", "group1-shard16of110.bin", "group1-shard17of110.bin", "group1-shard18of110.bin", "group1-shard19of110.bin", "group1-shard20of110.bin", "group1-shard21of110.bin", "group1-shard22of110.bin", "group1-shard23of110.bin", "group1-shard24of110.bin", "group1-shard25of110.bin", "group1-shard26of110.bin", "group1-shard27of110.bin", "group1-shard28of110.bin", "group1-shard29of110.bin", "group1-shard30of110.bin", "group1-shard31of110.bin", "group1-shard32of110.bin", "group1-shard33of110.bin", "group1-shard34of110.bin", "group1-shard35of110.bin", "group1-shard36of110.bin", "group1-shard37of110.bin", "group1-shard38of110.bin", "group1-shard39of110.bin", "group1-shard40of110.bin", "group1-shard41of110.bin", "group1-shard42of110.bin", "group1-shard43of110.bin", "group1-shard44of110.bin", "group1-shard45of110.bin", "group1-shard46of110.bin", "group1-shard47of110.bin", "group1-shard48of110.bin", "group1-shard49of110.bin", "group1-shard50of110.bin", "group1-shard51of110.bin", "group1-shard52of110.bin", "group1-shard53of110.bin", "group1-shard54of110.bin", "group1-shard55of110.bin", "group1-shard56of110.bin", "group1-shard57of110.bin", "group1-shard58of110.bin", "group1-shard59of110.bin", "group1-shard60of110.bin", "group1-shard61of110.bin", "group1-shard62of110.bin", "group1-shard63of110.bin", "group1-shard64of110.bin", "group1-shard65of110.bin", "group1-shard66of110.bin", "group1-shard67of110.bin", "group1-shard68of110.bin", "group1-shard69of110.bin", "group1-shard70of110.bin", "group1-shard71of110.bin", "group1-shard72of110.bin", "group1-shard73of110.bin", "group1-shard74of110.bin", "group1-shard75of110.bin", "group1-shard76of110.bin", "group1-shard77of110.bin", "group1-shard78of110.bin", "group1-shard79of110.bin", "group1-shard80of110.bin", "group1-shard81of110.bin", "group1-shard82of110.bin", "group1-shard83of110.bin", "group1-shard84of110.bin", "group1-shard85of110.bin", "group1-shard86of110.bin", "group1-shard87of110.bin", "group1-shard88of110.bin", "group1-shard89of110.bin", "group1-shard90of110.bin", "group1-shard91of110.bin", "group1-shard92of110.bin", "group1-shard93of110.bin", "group1-shard94of110.bin", "group1-shard95of110.bin", "group1-shard96of110.bin", "group1-shard97of110.bin", "group1-shard98of110.bin", "group1-shard99of110.bin", "group1-shard100of110.bin", "group1-shard101of110.bin", "group1-shard102of110.bin", "group1-shard103of110.bin", "group1-shard104of110.bin", "group1-shard105of110.bin", "group1-shard106of110.bin", "group1-shard107of110.bin", "group1-shard108of110.bin", "group1-shard109of110.bin", "group1-shard110of110.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense/bias", "shape": [64], "dtype": "float32"}, {"name": "gru/gru_cell/kernel", "shape": [768, 192], "dtype": "float32"}, {"name": "gru/gru_cell/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "gru/gru_cell/bias", "shape": [2, 192], "dtype": "float32"}, {"name": "outputs/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "outputs/bias", "shape": [1], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/word_embeddings/weight", "shape": [37788, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/token_type_embeddings/embeddings", "shape": [2, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/pooler/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/pooler/dense/bias", "shape": [768], "dtype": "float32"}]}]}